Repository: quarkusio/cn.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en
Languages: zh_cn

source: In our case, we want to configure the `address` attribute to indicate the name of the queue.
zh_cn: 在我们的情形中，我们想配置 `address` 属性来表示队列的名称。

source: In previous versions of this extension you had to set up your pom or gradle to zip up your executable for native deployments, but this is not the case anymore.
zh_cn: 在这个扩展的前几个版本中，你必须设置你的pom或gradle来为原生部署压缩你的可执行文件，但现在不再是这样了。

source: In rare cases, you may need to access the underlying Kafka clients. `KafkaClientService` provides thread-safe access to `Producer` and `Consumer`.
zh_cn: 在少数情况下，您可能需要访问底层的Kafka客户端。`KafkaClientService` 提供线程安全的方式来访问 `Producer` 和 `Consumer` 。

source: In some cases, this `iss` claim verification may not work. For example, if the discovered `issuer` property contains an internal HTTP/IP address while the token `iss` claim value contains an external HTTP/IP address. Or when a discovered `issuer` property contains the template tenant variable but the token `iss` claim value has the complete tenant-specific issuer value.
zh_cn: 在某些情况下，这种 `iss` 声明验证可能不起作用。例如，如果发现的 `issuer` 属性包含一个内部 HTTP/IP地址，而令牌 `iss` 声明值包含一个外部 HTTP/IP地址。或者当发现的 `issuer` 属性包含模板租户变量，但令牌 `iss` 声明值有完整的租户特定发行人(tenant-specific issuer )的值。

source: In some cases, you may want to programmatically check whether a request is granted to access a protected resource. By injecting a `SecurityIdentity` instance in your beans, you are allowed to check permissions as follows:
zh_cn: 在某些情况下，您可能想以编程方式检查一个请求是否被允许访问受保护的资源。通过在您的Bean中注入一个 `SecurityIdentity` 实例，您就可以按以下方式检查权限了：

source: In some cases, you may want to use the https://www.keycloak.org/docs/latest/authorization_services/#_service_client_api[Keycloak Authorization Client Java API] to perform specific operations like managing resources and obtaining permissions directly from Keycloak. For that, you can inject a `AuthzClient` instance into your beans as follows:
zh_cn: 在某些情况下，您可能想使用 link:https://www.keycloak.org/docs/latest/authorization_services/#_service_client_api[Keycloak授权客户端Java API] 来执行特定的操作，如管理资源和直接从Keycloak获得权限。为此，您可以按以下方式将一个 `AuthzClient` 实例注入到您的bean中：

source: In some use cases, it is convenient to use the messaging patterns to transfer messages inside the same application. When you don't connect a channel to a messaging backend like Kafka, everything happens in-memory, and the streams are created by chaining methods together. Each chain is still a reactive stream and enforces the back-pressure protocol.
zh_cn: 在某些情况下，使用消息模式在同一个应用程序内传输消息是很方便的。当您没有将channel连接到像Kafka这样的消息后端时，一切都会发生在内存中，并且流会通过链式方法创建。每个链式调用仍是一个响应式流，并执行背压策略。

source: In such a situation, the error you might encounter is:
zh_cn: 在这种情况下，你可能遇到的错误是：

source: In such case (if you don't want to wait for the new command to be supported in https://github.com/vert-x3/vertx-redis-client[`vertx-redis-client`]), you can implement it in either https://github.com/quarkusio/quarkus/blob/main/extensions/redis-client/runtime/src/main/java/io/quarkus/redis/client/RedisClient.java[`RedisClient`] or https://github.com/quarkusio/quarkus/blob/main/extensions/redis-client/runtime/src/main/java/io/quarkus/redis/client/reactive/ReactiveRedisClient.java[`ReactiveRedisClient`]. In order to do so, you will need:
zh_cn: 在这种情况下，如果你不想等到未来版本的 link:https://github.com/vert-x3/vertx-redis-client[`vertx-redis-client`] 支持这些命令，可以在 link:https://github.com/quarkusio/quarkus/blob/main/extensions/redis-client/runtime/src/main/java/io/quarkus/redis/client/RedisClient.java[`RedisClient`] 或 link:https://github.com/quarkusio/quarkus/blob/main/extensions/redis-client/runtime/src/main/java/io/quarkus/redis/client/reactive/ReactiveRedisClient.java[`ReactiveRedisClient`] 中实现它们。实现自定义的Redis命令需要：

source: In such cases you may want to consider skipping the issuer verification by setting `quarkus.oidc.token.issuer=any`. Please note that it is not recommended and should be avoided unless no other options are available:
zh_cn: 在这种情况下，你可能要考虑通过设置 `quarkus.oidc.token.issuer=any` ，来跳过发行人验证。请注意，不建议这样做，除非没有其他选择，否则应避免这样做：

source: In such cases, if you work with Keycloak then please start it with a `KEYCLOAK_FRONTEND_URL` system property set to the externally accessible base URL. If you work with other Openid Connect providers then please check your provider's documentation.
zh_cn: 在这种情况下，如果你使用Keycloak，那么请用 `KEYCLOAK_FRONTEND_URL` 系统属性设置为外部可访问的基本URL来启动它。如果你使用其他Openid Connect提供商，那么请查看你的提供商的文档。

source: In the Kotlin version, we've simply moved the bulk of the link:https://www.martinfowler.com/eaaCatalog/activeRecord.html[`active record pattern`] functionality to the `companion object`. Apart from this slight change, we can then work with our types in ways that map easily from the Java side of world.
zh_cn: 在Kotlin版本中，我们只是把大部分的功能 link:https://www.martinfowler.com/eaaCatalog/activeRecord.html[`active record pattern`] 转移到了 `companion object` 。除了这个细微的变化，我们还可以从 Java 方面轻松映射的方式来处理我们的类型。

source: In the `org.acme.spring.scheduler` package, create the `CounterBean` class, with the following content:
zh_cn: 在 `org.acme.spring.scheduler` 包中，使用以下内容创建 `CounterBean` 类:

source: In the `pom.xml` file, the `native` profile contains:
zh_cn: 在 `pom.xml` 文件中， `native` 配置文件包含：

source: In the `src/main/resource` directory, create a `lorem.txt` file with the following content:
zh_cn: 在 `src/main/resource` 目录中，创建一个包含以下内容的 `lorem.txt` 文件:

source: In the case of `dead-letter-queue`, you can configure the following attributes:
zh_cn: 在 `dead-letter-queue` 情况下 ，您可以配置以下属性：

source: In the console you'll see startup messages from the lambda. This particular deployment starts a JVM and loads your lambda as pure Java.
zh_cn: 在控制台，你会看到lambda的启动信息。这个特定的部署启动了一个JVM，并将你的lambda作为纯Java加载。

source: In the context of an extension, Quarkus eliminates the need for a JSON configuration file by allowing extension authors to specify a `NativeImageResourceBuildItem`:
zh_cn: 在扩展里面，Quarkus通过允许扩展的作者指定一个 `NativeImageResourceBuildItem` 来消除对JSON配置文件的需求：

source: In the default configuration, Keycloak is responsible for managing the roles and deciding who can access which routes.
zh_cn: 在默认配置中，Keycloak负责管理角色并决定谁可以访问哪些路由。

source: In the example below, this can be easily solved by adapting the annotation, adding @field: Default, to handle the lack of a @Target on the Kotlin reflection annotation definition.
zh_cn: 在下面的示例中，通过调整注解，添加@field:Default来处理Kotlin反射注解定义中缺少@Target，就可以很容易地解决这一问题。

source: In the following example we set-up a consumer that always starts on messages from at most 10 minutes ago (or offset 0). First we need to provide a bean that implements `io.smallrye.reactive.messaging.kafka.KafkaConsumerRebalanceListener` and is annotated with `io.smallrye.common.annotation.Identifier`. We then must configure our inbound connector to use this bean.
zh_cn: 在下面例子设置的消费者中，它总是会在最多10分钟前(或偏移量0)的消息上启动。首先，我们需要提供一个实现了 `io.smallrye.reactive.messaging.kafka.KafkaConsumerRebalanceListener` 并被注解为 `io.smallrye.common.annotation.Identifier` 的bean。然后我们必须配置inbound connector来使用这个Bean。

source: In the future, `@NativeImageTest` will be deprecated in favor of `@QuarkusIntegrationTest` which provides a superset of the testing capabilities of `@NativeImageTest`. More information about `@QuarkusIntegrationTest` can be found in the xref:getting-started-testing.adoc#quarkus-integration-test[Testing Guide].
zh_cn: 在未来， `@NativeImageTest` 将被弃用，取而代之的是`@QuarkusIntegrationTest` ，它提供了 `@NativeImageTest` 的测试能力的超集。关于 `@QuarkusIntegrationTest` 的更多信息可以在 xref:getting-started-testing.adoc#quarkus-integration-test[测试指南]中找到。

source: In the generated build file, you can see 2 test dependencies:
zh_cn: 在生成的构建文件中，你可以看到2个测试依赖项：

source: In the previous snippet we were able to simply use `reflection-config.json` instead of specifying the entire path of the file simply because it was added to `src/main/resources`. If the file had been added to another directory, the proper file path would have had to be specified manually.
zh_cn: 在前面的片段中，我们能够简单地使用 `reflection-config.json` ，而不是指定文件的整个路径，只是因为它被添加到了 `src/main/resources` 。如果该文件被添加到了另一个目录，就必须手动指定适当的文件路径。

source: In the previous snippet we were able to simply use `resources-config.json` instead of specifying the entire path of the file simply because it was added to `src/main/resources`. If the file had been added to another directory, the proper file path would have had to be specified manually.
zh_cn: 在前面的片段中，我们能够简单地使用 `resources-config.json` ，而不是指定文件的整个路径，只是因为它被添加到了 `src/main/resources` 。如果该文件被添加到了另一个目录，就必须手动指定适当的文件路径。

source: In the same directory, create an `import.sql` file, which inserts a few fruits, so we don't start with an empty database in dev mode:
zh_cn: 在同一个目录中，创建一个 `import.sql` 文件，它插入了一些水果数据，所以我们不会在dev模式中面对一个空数据库开始：

source: In the traditional and imperative approach, frameworks assign a thread to handle the request. So, the whole processing of the request runs on this worker thread. This model does not scale very well. Indeed, to handle multiple concurrent requests, you need multiple threads; and so your application concurrency is constrained by the number of threads. In addition, these threads are blocked as soon as your code interacts with remote services. So, it leads to inefficient usage of the resources, as you may need more threads, and each thread, as they are mapped to OS threads, has a cost in terms of memory and CPU.
zh_cn: 在传统的指令式方法中，框架分配一个线程来处理请求。因此，请求的整个处理都运行在这个工作线程上。这个模型的扩展性不太好。事实上，要处理多个并发请求，你需要多个线程。因此，应用程序的并发性受到线程数量的限制。此外，只要您的代码与远程服务交互，这些线程就会被阻塞。因此，这会导致资源的低效使用，因为您可能需要更多的线程，而每个线程在映射到OS线程时，在内存和CPU方面都有成本。

source: In this case, the connector looks for the `Map` associated with the `my-configuration` name. If `kafka-configuration` is not set, an optional lookup for a `Map` exposed with the channel name (`my-channel` in the previous example) is done.
zh_cn: 在这种情况下，连接器会查询与 `my-configuration` 名称相关的 `Map` 。如果没有设置 `kafka-configuration` ，就会进行额外的查询来寻找与 channel 名称相关的 `Map` (在前面的例子中是 `my-channel` )。

source: In this case, use the parameter `-Dquarkus.native.remote-container-build=true` instead of `-Dquarkus.native.container-build=true`.
zh_cn: 在这种情况下，使用参数 `-Dquarkus.native.remote-container-build=true` ，而不是 `-Dquarkus.native.container-build=true` 。

source: In this case, we use `Fruit.findById` to retrieve the fruit. It returns a `Uni`, which will complete when the database has retrieved the row.
zh_cn: 在本例中，我们使用 `Fruit.findById` 来检索水果。当数据库检索到该行时，它将返回一个 `Uni`。

source: In this example, a singleton CDI bean will produce two different `MeterFilter` beans. One will be applied only to Prometheus `MeterRegistry` instances (using the `@MeterFilterConstraint` qualifier), and another will be applied to all `MeterRegistry` instances. An application configuration property is also injected and used as a tag value. Additional examples of MeterFilters can be found in the link:https://micrometer.io/docs/concepts[official documentation].
zh_cn: 在这个例子中，一个CDI bean单例将产生两个不同的 `MeterFilter` beans。一个将只用于Prometheus `MeterRegistry` 实例（使用 `@MeterFilterConstraint` 修饰符），另一个将用于所有 `MeterRegistry` 实例。一个应用配置属性也被注入并作为标签值使用。MeterFilters的其他例子可以在 link:https://micrometer.io/docs/concepts[官方文档] 中找到。

source: In this example, we are using a single instance running on localhost:
zh_cn: 在此示例中，我们在 localhost 上运行的单个实例：

source: In this example, we build a very simple microservice which offers two endpoints:
zh_cn: 在该例子中，我们建立了一个非常简单的微服务并提供了两个节点：

source: In this example, we will create an application to manage a list of fruits.
zh_cn: 在这个例子中，我们将创建一个应用程序来管理fruit列表。

source: In this file, copy the following code:
zh_cn: 在该文件中，拷贝以下代码:

source: In this guide, we are going to develop two applications communicating with an AMQP broker. We will use https://activemq.apache.org/components/artemis/[Artemis], but you can use any AMQP 1.0 broker. The first application sends a _quote request_ to an AMQP queue and consumes messages from the _quote_ queue. The second application receives the _quote request_ and sends a _quote_ back.
zh_cn: 在本指南中，我们将开发两个与AMQP代理进行通信的应用程序。我们将使用 link:https://activemq.apache.org/components/artemis/[Artemis] ，但你可以使用任何AMQP 1.0代理。第一个应用程序向AMQP队列发送一个 _quote request_ ，并消费 _quote_ queue 中的消息。第二个应用程序接收 _quote request_ ， 并发送一个 _quote_ back。

source: In this guide, we are going to expose a simple Rest API to increment numbers by using the https://redis.io/commands/incrby[`INCRBY`] command. Along the way, we'll see how to use other Redis commands like `GET`, `SET`, `DEL` and `KEYS`.
zh_cn: 在本指南中，我们将开发一个简单的Rest API，其将使用 link:https://redis.io/commands/incrby[`INCRBY`] 命令来递增数字。在此过程中，我们将学会如何使用其他Redis命令，如 `GET` , `SET` , `DEL` 和 `KEYS` 。

source: In this guide, we create a straightforward REST application to demonstrate distributed tracing.
zh_cn: 在本指南中，我们创建了一个简单的REST应用程序来演示分布式跟踪服务。

source: In this guide, we create a straightforward application serving a `hello` endpoint. To demonstrate dependency injection, this endpoint uses a `greeting` bean.
zh_cn: 在本指南中，我们创建了一个简单的应用程序，为 `hello` 端点提供服务。为了演示依赖性注入，这个端点使用了一个 `greeting` bean。

source: In this guide, we expand on the initial test that was created as part of the Getting Started Guide. We cover injection into tests and also how to test native executables.
zh_cn: 在本指南中，我们对作为入门指南的一部分而创建的初始测试进行扩展。我们涵盖了注入测试以及如何测试本地可执行文件。

source: In this guide, we see how you can get your REST services to consume and produce JSON payloads.
zh_cn: 在本指南中，我们将了解如何使用REST服务和生成有效的JSON。

source: In this guide, we see how you can get your REST services to use the MongoDB database.
zh_cn: 在本指南中，我们看到如何让你的REST服务使用MongoDB数据库。

source: In this guide, we will discuss how you can get your native executables to support SSL, as native executables don't support it out of the box.
zh_cn: 在本指南中，我们将讨论如何让你的原生可执行文件支持SSL，因为原生可执行文件并不支持开箱即用。

source: In this guide, we will explore:
zh_cn: 在本指南中，我们将探讨：

source: In this guide, we will get you started with some reactive features of Quarkus. We are going to implement a simple CRUD application. Yet, unlike in the xref:hibernate-orm-panache.adoc[Hibernate with Panache guide], it uses the reactive features of Quarkus.
zh_cn: 在本指南中，我们将带您开始了解Quarkus的一些响应式功能。 我们将实现一个简单的 CRUD 应用程序。 这部分与 xref:hibernate-orm-panache.adoc[Hibernate与Panache指南]不同，它使用了Quarkus的响应式功能。

source: In this guide, we will use Mutiny. To know more about Mutiny, check the xref:mutiny-primer.adoc[Mutiny documentation].
zh_cn: 在本指南中，我们将使用Mutiny。想要了解更多关于Mutiny的信息，请查看 xref:mutiny-primer.adoc[Mutiny文档]。

source: In this scenario, you do not need to protect your Quarkus endpoint by using the Quarkus OpenID Connect adapter.
zh_cn: 在这种情况下，您不需要通过使用Quarkus OpenID Connect适配器来保护您的Quarkus节点。

source: In this test the `mockableBean2` is configured, so it returns the configured response.
zh_cn: 在这个测试中， `mockableBean2` 进行了配置，所以它返回配置好的响应。

source: In your HTTP endpoint class, inject the event bus and uses the `request` method to send a message to the event bus and expect a response:
zh_cn: 在你的HTTP端点类中，注入事件总线，并使用 `request` 方法向事件总线发送一个消息，并期待一个响应：

source: In your `Dockerfile`, just use:
zh_cn: 在你的 `Dockerfile` 中，只需使用:

source: In your `pom.xml`, add the following dependencies:
zh_cn: 在你的 `pom.xml` 文件中添加以下依赖项：

source: In your build file you should see 2 test dependencies:
zh_cn: 在您的构建文件中应该有2个测试依赖：

source: In your build file, add the following dependencies:
zh_cn: 在build文件中添加以下依赖项。

source: In-Person and online events which feature Quarkus tracks, discussion and topics.
zh_cn: 以Quarkus为特色的现场和在线活动、讨论和话题。

source: In-memory channels
zh_cn: 内存 channels

source: Inbound Metadata
zh_cn: 入站元数据

source: Including resources
zh_cn: 包含资源

source: Incoming Attributes of the 'smallrye-kafka' connector
zh_cn: 'smallrye-kafka' 连接器的传入属性

source: Incoming channel configuration
zh_cn: 传入通道配置

source: Incoming channel configuration (polling from Kafka)
zh_cn: 入站 channel 配置(从Kafka轮询)

source: Increment a value given its key
zh_cn: 递增指定键的值

source: Increment the `first` value by 27.
zh_cn: 将 `first` 的值增加27。

source: Indicate that the `topic` property is a regular expression. Must be used with the `topic` property. Cannot be used with the `topics` property Type: _boolean_
zh_cn: 表示 `topic` 属性是一个正则表达式。必须与 `topic` 属性一起使用。不能与 `topics` 属性一起使用 类型: _boolean_

source: Indicate that this injection point is meant to use an instance of `RestClient`.
zh_cn: 这里表示这个注入点使用了 `RestClient` 的实例。

source: Indicates that the content is sent using `Server Sent Events`
zh_cn: 表示内容是使用 `Server Sent Events` 发送的

source: Indicates that the method consumes the items from the `requests` channel
zh_cn: 表示该方法消费 `requests` 通道中的项

source: Indicates that the objects returned by the method are sent to the `quotes` channel
zh_cn: 表示方法返回的对象被发送给 `quotes` 通道

source: Indicates that the processing is _blocking_ and cannot be run on the caller thread.
zh_cn: 表示该处理是 _blocking_ ，不能在调用者线程上运行。

source: Infinispan is an in memory data grid that allows running in a server outside of application processes. This extension provides functionality to allow the client that can connect to said server when running in Quarkus.
zh_cn: Infinispan是一个内存中的数据网格，允许在应用程序进程之外的服务器中运行。这个扩展提供了功能，允许在Quarkus中运行时可以连接到所述服务器的客户端。

source: Inject Flyway for named datasources
zh_cn: 为命名的数据源注入Flyway

source: Inject Flyway for named datasources using the Quarkus `FlywayDataSource` qualifier
zh_cn: 使用Quarkus `FlywayDataSource` 限定符为指定的数据源注入Flyway。

source: Inject JWT as MP JSON Web Token (JWT)
zh_cn: 将JWT注入为MP Json Web Token（JWT）

source: Inject a Reactive Messaging `Emitter` to send messages to the `quote-requests` channel.
zh_cn: 注入一个响应式消息 `Emitter` ，来向 `quote-requests` 通道发送消息。

source: Inject a `MutinyEmitter` which exposes a Mutiny API. It simplifies the integration with the Mutiny API exposed by Hibernate Reactive with Panache.
zh_cn: 注入一个暴露了Mutiny API的 `MutinyEmitter` 。它简化了与Hibernate Reactive with Panache所暴露的Mutiny API的整合。

source: Inject an `Emitter<String>`
zh_cn: 注入一个 `Emitter<String>`

source: Inject the Event bus
zh_cn: 注入事件总线

source: Inject the Flyway object if you want to use it directly
zh_cn: 如果你想直接使用Flyway对象，请注入该对象

source: Inject the Reactive Redis client
zh_cn: 注入Redis响应式客户端

source: Inject the Redis synchronous client
zh_cn: 注入Redis同步客户端

source: Inject the `CounterBean`
zh_cn: 注入 `CounterBean`

source: Inject the `TransactionManager` to be able to activate `setRollbackOnly` semantic.
zh_cn: 注入 `TransactionManager` ，能够激活 `setRollbackOnly` 语义。

source: Inject the in-memory connector in your test class.
zh_cn: 在您的测试类中注入内存内连接器。

source: Injectable AWS Context Variables
zh_cn: 可注入的AWS上下文变量

source: Injecting `@Channel("prices")` or having `@Incoming("prices")` does not automatically configure the application to consume messages from Kafka. You need to configure an inbound connector with `mp.messaging.incoming.prices\...` or have an `@Outgoing("prices")` method somewhere in your application (in which case, `prices` will be an in-memory channel).
zh_cn: 注入 `@Channel("prices")` 或使用 `@Incoming("prices")` 无法通过配置使应用程序自动从Kafka消费消息。您需要用 `mp.messaging.incoming.prices...` 配置一个接收connector，或者在您的应用程序中使用 `@Outgoing("prices")` 方法(在这种情况下， `prices` 将是一个内存型channel)。

source: Injecting a URI
zh_cn: 注入URI

source: Injecting beans
zh_cn: 注入beans

source: Injecting properties
zh_cn: 注入属性

source: Injecting the Authorization Client
zh_cn: 注入授权客户端

source: Injection Discovery/Navigation
zh_cn: 注入发现/导航跳转

source: Injection into tests
zh_cn: 注入测试

source: Injection is also supported into objects that implement `io.quarkus.test.common.DevServicesContext.ContextAware`. If you have a field that implements `io.quarkus.test.common.DevServicesContext.ContextAware` Quarkus will call the `setIntegrationTestContext` method to pass the context into this object. This allows client logic to be encapsulated in a utility class.
zh_cn: 该注入也支持在实现了 `io.quarkus.test.common.DevServicesContext.ContextAware` 的对象中。如果您有一个实现了 `io.quarkus.test.common.DevServicesContext.ContextAware` 的字段，Quarkus将调用 `setIntegrationTestContext` 方法来将上下文传入这个对象中。这将允许客户端逻辑被允许封装在一个实用类中。

source: Injection of `JsonWebToken` is supported in `@ApplicationScoped`, `@Singleton` and `@RequestScoped` scopes however the use of `@RequestScoped` is required if the individual claims are injected as simple types, please see xref:security-jwt.adoc#supported-injection-scopes[Support Injection Scopes for JsonWebToken and Claims] for more details.
zh_cn: 在 `@ApplicationScoped` , `@Singleton` 和 `@RequestScoped` 范围上下文中支持注入 `JsonWebToken` ，但是如果单个声明被注入为简单类型，则需要使用 `@RequestScoped` ，更多细节请参见 link:security-jwt.html#supported-injection-scopes[JsonWebToken和声明所支持注入范围(Injection Scopes)] 。

source: Injection of resources into tests
zh_cn: 将资源注入测试中

source: Injection of the `SecurityIdentity` is supported in both `@RequestScoped` and `@ApplicationScoped` contexts.
zh_cn: 在 `@RequestScoped` 和 `@ApplicationScoped` 的上下文中都支持 `SecurityIdentity` 注入。

source: Injects the `quotes` channel using the `@Channel` qualifier
zh_cn: 使用 `@Channel` 修饰符注入 `quotes` 通道

source: Inner-signed and encrypted or encrypted tokens
zh_cn: Inner-Signed/Encrypted 或 Encrypted tokens

source: Inside a consumer group, as new group members arrive and old members leave, the partitions are re-assigned so that each member receives a proportional share of the partitions. This is known as rebalancing the group. To handle offset commit and assigned partitions yourself, you can provide a consumer rebalance listener. To achieve this, implement the `io.smallrye.reactive.messaging.kafka.KafkaConsumerRebalanceListener` interface and expose it as a CDI bean with the `@Idenfier` qualifier. A common use case is to store offset in a separate data store to implement exactly-once semantic, or starting the processing at a specific offset.
zh_cn: 在一个消费者组内，随着新老组员的交替，分区将会被重新分配，从而使每个组员都能分配到分区。这就是组的再平衡。为了处理偏移提交以及分区的分配，您可以提供一个消费者再平衡监听器。为了实现这一点，请实现 `io.smallrye.reactive.messaging.kafka.KafkaConsumerRebalanceListener` 接口，并将其暴露为CDI bean并使用 `@Idenfier` 修饰符修饰。一个常见的用例是将偏移量存储在一个单独的数据存储中以使其保证语义上的精准一次(exactly-once semantic)，或者在某一个特定的偏移量开始时处理。

source: Inside application configuration, channel names are unique. Therefore, if you'd like to configure an incoming and outgoing channel on the same topic, you will need to name channels differently (like in the examples of this guide, `mp.messaging.incoming.prices` and `mp.messaging.outgoing.prices-out`).
zh_cn: 在应用配置里面，channel名称是唯一的。因此，如果您打算在相同topic上同时配置一个接收和一个发送的channel，您需要对这两个 channels 使用不同的名称(比如本指南的例子，`mp.messaging.incoming.prices` 和 `mp.messaging.outgoing.prices-out` )。

source: Inside the `producer` project locate the generated `src/main/java/org/acme/amqp/producer/QuotesResource.java` file, and update the content to be:
zh_cn: 在 `producer` 项目中找到生成的 `src/main/java/org/acme/amqp/producer/QuotesResource.java` 文件，并将其内容更新为：

source: Install GraalVM if you haven't already. You have a few options for this:
zh_cn: 如果你还没有安装 GraalVM。那么你有几个选择：

source: Install [bundler](https://jekyllrb.com/docs/ruby-101/#bundler) [gems](https://jekyllrb.com/docs/ruby-101/#gems)
zh_cn: 安装 [bundler](https://jekyllrb.com/docs/ruby-101/#bundler) [gems](https://jekyllrb.com/docs/ruby-101/#gems)

source: Install a full [Ruby development environment](https://jekyllrb.com/docs/installation/). If you use `rvm`, run: `rvm use 2.7.1`.
zh_cn: 安装完整的 [Ruby开发环境](https://jekyllrb.com/docs/installation/)。如果你使用 `rvm`, 运行: `rvm use 2.7.1`.

source: Install the [act](https://github.com/nektos/act#installation) executable to run GitHub Actions locally
zh_cn: 安装 [act](https://github.com/nektos/act#installation) 可执行文件本地运行GitHub Actions

source: Install via Command Line Interface
zh_cn: 通过命令行界面安装

source: Installation
zh_cn: 安装

source: Installing AWS bits
zh_cn: 安装AWS位

source: Installing all the AWS bits is probably the most difficult thing about this guide. Make sure that you follow all the steps for installing AWS CLI.
zh_cn: 安装所有AWS位可能是本指南中最困难的事情。请确保你遵循安装AWS CLI的所有步骤。

source: Installing all the AWS bits is probably the most difficult thing about this guide. Make sure that you follow all the steps for installing AWS SAM CLI.
zh_cn: 安装所有的AWS位可能是本指南中最困难的事情。请确保你遵循安装AWS SAM CLI的所有步骤。
